In [1]:
import pandas as pd

## 纵向拼接DataFrame

In [3]:
df1 = pd.DataFrame({
    '商品名': ['iPhone 12', 'MacBook Air', 'iPad', 'Apple Watch Series 6'],
    '单价（元）': [6799, 8499, 3199, 2699],
    '颜色': ['蓝色', '金色', '灰色', '粉色'],
    '库存数量': [100, 50, 150, 80]
})


df2 = pd.DataFrame({
    '商品名': ['AirPods Pro', 'HomePod mini', 'Apple TV 4K', 'Beats Flex'],
    '单价（元）': [1599, 749, 1499, 399],
    '颜色': ['白色', '空间灰色', '黑色', '黄色'],
    '库存数量': [120, 80, 60, 200]
})

In [4]:
df1

                    商品名  单价（元）  颜色  库存数量
0             iPhone 12   6799  蓝色   100
1           MacBook Air   8499  金色    50
2                  iPad   3199  灰色   150
3  Apple Watch Series 6   2699  粉色    80

In [5]:
df2

            商品名  单价（元）    颜色  库存数量
0   AirPods Pro   1599    白色   120
1  HomePod mini    749  空间灰色    80
2   Apple TV 4K   1499    黑色    60
3    Beats Flex    399    黄色   200

In [6]:
# 纵向拼接df1和df2
pd.concat([df1,df2])

                    商品名  单价（元）    颜色  库存数量
0             iPhone 12   6799    蓝色   100
1           MacBook Air   8499    金色    50
2                  iPad   3199    灰色   150
3  Apple Watch Series 6   2699    粉色    80
0           AirPods Pro   1599    白色   120
1          HomePod mini    749  空间灰色    80
2           Apple TV 4K   1499    黑色    60
3            Beats Flex    399    黄色   200

In [7]:
# 纵向拼接df1和df2（忽略索引）
pd.concat([df1,df2],ignore_index=True)

                    商品名  单价（元）    颜色  库存数量
0             iPhone 12   6799    蓝色   100
1           MacBook Air   8499    金色    50
2                  iPad   3199    灰色   150
3  Apple Watch Series 6   2699    粉色    80
4           AirPods Pro   1599    白色   120
5          HomePod mini    749  空间灰色    80
6           Apple TV 4K   1499    黑色    60
7            Beats Flex    399    黄色   200

In [8]:
df3 = pd.DataFrame({
    '商品名': ['iPhone 12', 'MacBook Air', 'iPad', 'Apple Watch Series 6'],
    '单价（元）': [6799, 8499, 3199, 2699],
    '颜色': ['蓝色', '金色', '灰色', '粉色'],
    '库存数量': [100, 50, 150, 80]
})


df4 = pd.DataFrame({
    '商品名': ['AirPods Pro', 'HomePod mini', 'Apple TV 4K', 'Beats Flex'],
    '单价': [1599, 749, 1499, 399],
    '颜色': ['白色', '空间灰色', '黑色', '黄色'],
    '库存数量': [120, 80, 60, 200]
})

In [9]:
df3

                    商品名  单价（元）  颜色  库存数量
0             iPhone 12   6799  蓝色   100
1           MacBook Air   8499  金色    50
2                  iPad   3199  灰色   150
3  Apple Watch Series 6   2699  粉色    80

In [10]:
df4

            商品名    单价    颜色  库存数量
0   AirPods Pro  1599    白色   120
1  HomePod mini   749  空间灰色    80
2   Apple TV 4K  1499    黑色    60
3    Beats Flex   399    黄色   200

In [11]:
# 纵向拼接df3和df4（忽略索引）
pd.concat([df3,df4],ignore_index=True)

                    商品名   单价（元）    颜色  库存数量      单价
0             iPhone 12  6799.0    蓝色   100     NaN
1           MacBook Air  8499.0    金色    50     NaN
2                  iPad  3199.0    灰色   150     NaN
3  Apple Watch Series 6  2699.0    粉色    80     NaN
4           AirPods Pro     NaN    白色   120  1599.0
5          HomePod mini     NaN  空间灰色    80   749.0
6           Apple TV 4K     NaN    黑色    60  1499.0
7            Beats Flex     NaN    黄色   200   399.0

## 横向拼接DataFrame

In [12]:
df5 = pd.DataFrame({
    '商品名': ['iPhone 12', 'MacBook Air', 'iPad', 'Apple Watch Series 6'],
    '单价（元）': [6799, 8499, 3199, 2699]
})


df6 = pd.DataFrame({
    '颜色': ['蓝色', '金色', '灰色', '粉色'],
    '库存数量': [100, 50, 150, 80]
})

In [13]:
df5

                    商品名  单价（元）
0             iPhone 12   6799
1           MacBook Air   8499
2                  iPad   3199
3  Apple Watch Series 6   2699

In [14]:
df6

   颜色  库存数量
0  蓝色   100
1  金色    50
2  灰色   150
3  粉色    80

In [15]:
# 横向拼接df3和df4
pd.concat([df5,df6],axis=1)

                    商品名  单价（元）  颜色  库存数量
0             iPhone 12   6799  蓝色   100
1           MacBook Air   8499  金色    50
2                  iPad   3199  灰色   150
3  Apple Watch Series 6   2699  粉色    80

## 合并DataFrame

In [16]:
customer_df = pd.DataFrame({
    '客户ID': [1, 2, 3, 4],
    '姓名': ['Amy', 'Bill', 'Cathy', 'Dave'],
    '邮箱': ['amy@xxx.com', 'bill@xxx.com', 'cat@xxx.com', 'dave@xxx.com']
})

order_df = pd.DataFrame({
    '订单ID': [1, 2, 3, 4, 5],
    '客户ID': [1, 1, 2, 4, 4],
    '销售额': [100, 50, 75, 90, 120]
})

In [17]:
customer_df

   客户ID     姓名            邮箱
0     1    Amy   amy@xxx.com
1     2   Bill  bill@xxx.com
2     3  Cathy   cat@xxx.com
3     4   Dave  dave@xxx.com

In [18]:
order_df

   订单ID  客户ID  销售额
0     1     1  100
1     2     1   50
2     3     2   75
3     4     4   90
4     5     4  120

In [19]:
# 根据“客户ID”合并customer_df和order_df
pd.merge(customer_df,order_df,on="客户ID")

   客户ID    姓名            邮箱  订单ID  销售额
0     1   Amy   amy@xxx.com     1  100
1     1   Amy   amy@xxx.com     2   50
2     2  Bill  bill@xxx.com     3   75
3     4  Dave  dave@xxx.com     4   90
4     4  Dave  dave@xxx.com     5  120

In [20]:
order_df2 = pd.DataFrame({
    '订单ID': ['A001', 'A002', 'A003', 'A004'],
    '订单日期': ['2000-01-01', '2000-01-02', '2000-01-02', '2000-01-03'],
    '客户ID': ['C001', 'C002', 'C001', 'C003'],
    '销售额': [100, 200, 150, 300]
})

customer_df2 = pd.DataFrame({
    '客户ID': ['C001', 'C002', 'C003'],
    '姓名': ['张三', '李四', '王五'],
    '手机号': ['13512345678', '13612345678', '13712345678'],
    '订单日期': ['2000-01-01', '2000-01-02', '2000-01-03']
})

In [21]:
order_df2

   订单ID        订单日期  客户ID  销售额
0  A001  2000-01-01  C001  100
1  A002  2000-01-02  C002  200
2  A003  2000-01-02  C001  150
3  A004  2000-01-03  C003  300

In [22]:
customer_df2

   客户ID  姓名          手机号        订单日期
0  C001  张三  13512345678  2000-01-01
1  C002  李四  13612345678  2000-01-02
2  C003  王五  13712345678  2000-01-03

In [23]:
# 根据“客户ID”和“订单日期”合并order_df2和customer_df2
pd.merge(order_df2,customer_df2,on=["客户ID","订单日期"])

   订单ID        订单日期  客户ID  销售额  姓名          手机号
0  A001  2000-01-01  C001  100  张三  13512345678
1  A002  2000-01-02  C002  200  李四  13612345678
2  A004  2000-01-03  C003  300  王五  13712345678

In [24]:
order_df3 = pd.DataFrame({
    '订单ID': ['A001', 'A002', 'A003', 'A004'],
    '订单日期': ['2000-01-01', '2000-01-02', '2000-01-02', '2000-01-03'],
    '客户编号': ['C001', 'C002', 'C001', 'C003'],
    '销售额': [100, 200, 150, 300]
})

customer_df3 = pd.DataFrame({
    '客户ID': ['C001', 'C002', 'C003'],
    '姓名': ['张三', '李四', '王五'],
    '手机号': ['13512345678', '13612345678', '13712345678'],
    '交易日期': ['2000-01-01', '2000-01-02', '2000-01-03']
})

In [25]:
order_df3

   订单ID        订单日期  客户编号  销售额
0  A001  2000-01-01  C001  100
1  A002  2000-01-02  C002  200
2  A003  2000-01-02  C001  150
3  A004  2000-01-03  C003  300

In [26]:
customer_df3

   客户ID  姓名          手机号        交易日期
0  C001  张三  13512345678  2000-01-01
1  C002  李四  13612345678  2000-01-02
2  C003  王五  13712345678  2000-01-03

In [27]:
# 根据order_df3的'客户编号'与'customer_df3的'客户ID'，以及order_df3的'订单日期'与'customer_df3的'交易日期'进行合并
pd.merge(order_df3,customer_df3,left_on=["客户编号","订单日期"],right_on=["客户ID","交易日期"])

   订单ID        订单日期  客户编号  销售额  客户ID  姓名          手机号        交易日期
0  A001  2000-01-01  C001  100  C001  张三  13512345678  2000-01-01
1  A002  2000-01-02  C002  200  C002  李四  13612345678  2000-01-02
2  A004  2000-01-03  C003  300  C003  王五  13712345678  2000-01-03

In [28]:
df7 = pd.DataFrame({'日期': ['2000-01-01', '2000-01-02', '2000-01-03'],
                    '店铺': ['A', 'B', 'C'],
                    '销售额': [100, 200, 300]})
df8 = pd.DataFrame({'日期': ['2000-01-02', '2000-01-03', '2000-01-04'],
                    '店铺': ['B', 'C', 'D'],
                    '销售额': [400, 500, 600]})

In [29]:
df7

           日期 店铺  销售额
0  2000-01-01  A  100
1  2000-01-02  B  200
2  2000-01-03  C  300

In [30]:
df8

           日期 店铺  销售额
0  2000-01-02  B  400
1  2000-01-03  C  500
2  2000-01-04  D  600

In [31]:
# 根据“日期”和“店铺”合并df7和df8
pd.merge(df7,df8,on=["日期","店铺"])

           日期 店铺  销售额_x  销售额_y
0  2000-01-02  B    200    400
1  2000-01-03  C    300    500

In [32]:
# 根据“日期”和“店铺”合并df7和df8，让df7的销售额列后缀为'_df7'，df8的销售额列后缀为'_df8'
pd.merge(df7,df8,on=["日期","店铺"],suffixes=("_df7","_df8"))

           日期 店铺  销售额_df7  销售额_df8
0  2000-01-02  B      200      400
1  2000-01-03  C      300      500

## 更多合并DataFrame例子

In [33]:
customers_data = {
    '客户ID': [1, 2, 3, 4, 5],
    '姓名': ['Tom', 'Bob', 'Mary', 'Alice', 'John'],
    '年龄': [20, 35, 27, 19, 42]
}
customer_df4 = pd.DataFrame(customers_data)


orders_data = {
    '订单ID': [1001, 1002, 1003, 1004, 1005, 1006],
    '订单日期': ['2000-03-12', '2000-03-13', '2000-03-13', '2000-03-15', '2000-03-18', '2000-03-21'],
    '客户ID': [1, 1, 2, 6, 5, 3],
    '产品': ['A', 'B', 'C', 'D', 'E', 'F'],
    '数量': [2, 3, 1, 4, 5, 2]
}
order_df4 = pd.DataFrame(orders_data)

In [34]:
customer_df4

   客户ID     姓名  年龄
0     1    Tom  20
1     2    Bob  35
2     3   Mary  27
3     4  Alice  19
4     5   John  42

In [35]:
order_df4

   订单ID        订单日期  客户ID 产品  数量
0  1001  2000-03-12     1  A   2
1  1002  2000-03-13     1  B   3
2  1003  2000-03-13     2  C   1
3  1004  2000-03-15     6  D   4
4  1005  2000-03-18     5  E   5
5  1006  2000-03-21     3  F   2

In [36]:
# inner合并customer_df4和order_df4
pd.merge(customer_df4,order_df4,on="客户ID",how="inner")

   客户ID    姓名  年龄  订单ID        订单日期 产品  数量
0     1   Tom  20  1001  2000-03-12  A   2
1     1   Tom  20  1002  2000-03-13  B   3
2     2   Bob  35  1003  2000-03-13  C   1
3     3  Mary  27  1006  2000-03-21  F   2
4     5  John  42  1005  2000-03-18  E   5

In [37]:
# outer合并customer_df4和order_df4
pd.merge(customer_df4,order_df4,on="客户ID",how="outer")

   客户ID     姓名    年龄    订单ID        订单日期   产品   数量
0     1    Tom  20.0  1001.0  2000-03-12    A  2.0
1     1    Tom  20.0  1002.0  2000-03-13    B  3.0
2     2    Bob  35.0  1003.0  2000-03-13    C  1.0
3     3   Mary  27.0  1006.0  2000-03-21    F  2.0
4     4  Alice  19.0     NaN         NaN  NaN  NaN
5     5   John  42.0  1005.0  2000-03-18    E  5.0
6     6    NaN   NaN  1004.0  2000-03-15    D  4.0

In [38]:
# left合并customer_df4和order_df4
pd.merge(customer_df4,order_df4,on="客户ID",how="left")

   客户ID     姓名  年龄    订单ID        订单日期   产品   数量
0     1    Tom  20  1001.0  2000-03-12    A  2.0
1     1    Tom  20  1002.0  2000-03-13    B  3.0
2     2    Bob  35  1003.0  2000-03-13    C  1.0
3     3   Mary  27  1006.0  2000-03-21    F  2.0
4     4  Alice  19     NaN         NaN  NaN  NaN
5     5   John  42  1005.0  2000-03-18    E  5.0

In [39]:
# right合并customer_df4和order_df4
pd.merge(customer_df4,order_df4,on="客户ID",how="right")

   客户ID    姓名    年龄  订单ID        订单日期 产品  数量
0     1   Tom  20.0  1001  2000-03-12  A   2
1     1   Tom  20.0  1002  2000-03-13  B   3
2     2   Bob  35.0  1003  2000-03-13  C   1
3     6   NaN   NaN  1004  2000-03-15  D   4
4     5  John  42.0  1005  2000-03-18  E   5
5     3  Mary  27.0  1006  2000-03-21  F   2

## 根据索引合并DataFrame

In [40]:
customer_df4

   客户ID     姓名  年龄
0     1    Tom  20
1     2    Bob  35
2     3   Mary  27
3     4  Alice  19
4     5   John  42

In [41]:
order_df4

   订单ID        订单日期  客户ID 产品  数量
0  1001  2000-03-12     1  A   2
1  1002  2000-03-13     1  B   3
2  1003  2000-03-13     2  C   1
3  1004  2000-03-15     6  D   4
4  1005  2000-03-18     5  E   5
5  1006  2000-03-21     3  F   2

In [45]:
# 根据索引合并customer_df4和order_df4，列后缀分别为"_customer"和"_order"
customer_df4.join(order_df4,how="inner",lsuffix="_customer",rsuffix="_order")

   客户ID_customer     姓名  年龄  订单ID        订单日期  客户ID_order 产品  数量
0              1    Tom  20  1001  2000-03-12           1  A   2
1              2    Bob  35  1002  2000-03-13           1  B   3
2              3   Mary  27  1003  2000-03-13           2  C   1
3              4  Alice  19  1004  2000-03-15           6  D   4
4              5   John  42  1005  2000-03-18           5  E   5